# 0 -> 0 днів, 00:00:00
# 224930 -> 2 дні, 14:28:50
# 466289 -> 5 днів, 09:31:29
# 950400 -> 11 днів, 00:00:00
# 1209600 -> 14 днів, 00:00:00
# 1900800 - > 22 дні, 00:00:00
# 8639999 -> 99 днів, 23:59:59
# 22493 -> 0 днів, 06:14:53
# 7948799 -> 91 день, 23:59:59

while True:
    sec = int(input('Введіть кількість секунд від 0 до 8640000: '))
    if 8640000 > sec >= 0:
        days = divmod(sec, 24 * 60 * 60)
        hours = divmod(days[1], 60 * 60)
        minutes = divmod(hours[1], 60)
        sec = minutes[1]
        if days[0] % 10 == 1 and days[0] % 100 != 11:
            x = "день"
        elif days[0] % 10 in [2, 3, 4] and not (12 <= days[0] % 100 <= 14):
            x = "дні"
        else:
            x = "днів"

        print(f'{days[0]} {x}, {hours[0]:02}:{minutes[0]:02}:{sec:02}')
        break
    else:
        print('Невірний діапазон! Спробуй ще!')
