'''
Additional task 10
# Напишіть програму, яка запитує у користувача ціле позитивне число і перевіряє,
# чи є воно простим. Просте число - це число, яке ділиться тільки на 1 і на само
# себе без залишку. Використовуйте цикл і перевірку поділу числа на всі числа
# від 2 до N-1 для вирішення задачі.
# Виведіть відповідне повідомлення на екран за допомогою print.
#
# Приклад:
# Введіть позитивне число: 17
# Число 17 є простим.
# else у циклі for — не те саме, що else у if.
# У циклі for/while конструкція else виконується тільки тоді, коли цикл завершився без break
'''

var = int(input('Введіть позитивне число: '))
for i in range(2, var - 1):
    if var % i  == 0:
        print('Ne proste')
        break
else:
    print('Proste')