'''
Additional task 11
# Напишіть програму, яка запитує у користувача натуральне десяткове число і
# виводить його двійкове уявлення. Реалізуйте алгоритм переведення числа в
# двійкову систему числення, використовуючи основні концепції подання чисел
# (підказка: через розподіл із залишком). Виведіть отримане подання числа на екран.
#
# Приклад:
# Введіть натуральне десяткове число: 123
# Двійкове уявлення числа: 1111011
'''

var = int(input('Введіть позитивне число: '))
l = []
while True:
    p = var % 2
    # print(f'p = {var}%{p}')
    if p == 0:
        l.append('0')
    elif p == 1:
        l.append('1')
    # print(l)
    k = var // 2
    var = k
    if var == 1 or var == 0:
        l.append(str(var))
        break

    # print(f'var = {var}')
print(f'{"".join(l[::-1])}')

###########OR#################

number = int(input('Введіть натуральне десяткове число:'))
res = ''
while number > 0:
    res = str(number % 2) + res
    #print(res)
    number //= 2
print('Двійкове уявлення числа:', res)