'''
Additional task 14
# Напишіть програму, яка запитує у користувача ціле число і перевіряє, чи
# є воно числом Армстронга. Число Армстронга - це число, яке дорівнює сумі
# своїх цифр, зведених у ступінь, що дорівнює кількості цифр у числі.
# Виведіть відповідне повідомлення на екран за допомогою команди # print.
#
# Приклад:
# Введіть ціле число: 153 (це без виводу на екран: 153 = 2**3 + 5**3 + 3**3)
# Число є числом Армстронга.
'''

# num = input('Enter number: ')
# n = int(num)
# l = len(num)
# arm = 0
# for i in range(l):
#     a, b = divmod(n, 10)
#     arm = arm + b ** l
#     n = a
# print(arm)
# if arm == int(num):
#     print('Число Армстронга')
# else:
#     print('не є числом Армстронга')