'''
Additional task 20
# Напишіть програму, яка запитує у користувача суму у євро і потім виводить:
# мінімальну кількисть купюр та мінімальну кількість монет для того, щоб
# отримати цю суму у євро. Зверніть увагу на те, що банкноти євро мають
# номінали: 5, 10, 20, 50, 100, 200 та 500 евро. А монети: 1 та 2 євро,
# 1, 2, 5, 10, 20 та 50 євроцентів.
# Крім того треба надрукувати кількість кожного номіналу котрий
# використовується для отримання даної суми.
# * Бажано, щоб суму можна було вводити як через крапку так і через кому.

# Приклад: Введіть суму: 347,78
# Кількість банкнот: 5
# Кількість монет: 7
# Склад суми:
# 1 x 200
# 1 x 100
# 2 x 20
# 1 x 5
# 2 x 1
# 1 x 0.5
# 1 x 0.2
# 1 x 0.05
# 1 x 0.02
# 1 x 0.01
'''

# from collections import defaultdict
#
# euro = float(input('Enter num euro: ').replace(',', '.'))
#
# l_nom =[500, 200, 100, 50, 20, 10, 5, 2, 1, 0.5, 0.2, 0.1, 0.05, 0.02, 0.01]
# d = defaultdict(lambda: 0)
#
# for i in l_nom:
#     count, euro = divmod(euro, i)
#     d[i] = int(count)
#     euro = round(euro, 2)
#
# bank = {k: v for k, v in d.items() if k in [500, 200, 100, 50, 20, 10, 5] and v > 0}
# mon = {k: v for k, v in d.items() if k in [2, 1, 0.5, 0.2, 0.1, 0.05, 0.02, 0.01] and v > 0}
# print(f'Кількість банкнот: {sum(bank.values())}')
# print(f'Кількість монет: {sum(mon.values())}')
# for k, v, in bank.items():
#     print(f'Номінал банкноти {k} - {v:.0f} шт.')
# for k, v, in mon.items():
#     print(f'Номінал монети {k} - {v:.0f} шт.')