'''
Additional task 23
# Напишіть програму, яка приймає список чисел і повертає суму, мінімальне та
# максимальне значення зі списку. Використовуйте функцію для обробки списку
# чисел та повернення трьох значень. Виведіть результат на eкран за допомогою
# команди print.
#
# Приклад:
# Введіть числа через кому та пробіл: 3, 7, 2, 9, 2, 5
# Сума чисел: 27
# Мінімальне значення: 2
# Максимальне значення: 9
'''

# def process():
#     lst = input('Enter list(ex. (3, 7, 2, 9, 2, 5)): ')
#     r = [int(i) for i in lst.split(',')]
#     return sum(r), min(r), max(r)
#
# s, minimum, maximum = process()
# print(f'Сума чисел: {s}\nМінімальне значення: {minimum}\nМаксимальне значення: {maximum}')