'''
Additional task 24
# Напишіть програму, яка приймає рядок користувача та розбиває його на окремі
# слова. Потім програма має об'єднати слова у зворотному порядку. При цьому
# перше слово у зміненому порядку друкується з великої літери, а останнє котре
# було на першому місці і було з великої літери у зворотньому порядку
# друкується з маленької літери
#
# Приклад:
# Введіть строку: Програмування це цікаво та корисно
# Перевернута строка: Корисно та цікаво це програмування
'''

# input_text = input('Enter text: ')
#
# rev_text = input_text.split()[::-2]
#
# rev_text[0] = rev_text[0].capitalize()
# rev_text[-2] = rev_text[-2].lower()
#
# result_text = ' '.join(rev_text)
#
# print(result_text)