'''
Additional task 25
!!!!!!!!!!!!!!!!
# Напишіть програму, яка приймає рядок від користувача та розбиває його на окремі
# слова. Потім програма має створити новий кортеж, що містить довжину кожного
# слова у вихідному рядку. Використовуйте методи рядків та кортежів для обробки даних.
#
# Приклад:
# Введіть речення: Програмування це цікаво та корисно
# Довжини слів у реченні: (13, 2, 6, 2, 7)
'''

# def word_count(st):
#     a = st[:]
#     punctuation = ".,;:!?—()[]{}\"'…«»`~@#$%^&*-_=+|\\/<>"
#     for letter in a:
#         if letter in punctuation:
#             a = a.replace(letter, '')
#     print(a)
#     return tuple(len(word) for word in a.split())
#
# t = word_count('Програмування, це../ цікаво та корис!но')
# print(t)