'''
Additional task 26
# Напишіть програму, яка приймає список чисел від користувача та сортує
# його в порядку зменшення, використовуючи метод sort() і параметр
# reverse = True. Виведіть відсортований список на екрані.
#
# Приклад:
# Введіть список чисел, розділених пробілами: 5 2 8 2 3
# Відсортований список чисел: [8, 5, 3, 2, 2]
'''

# def digit_sort():
#     s = input('Enter digit ex. 5 2 8 2 3: ')
#     p = s.split()
#     p.sort(reverse=True)
#     return p
#
# f = digit_sort()
# print(f)