'''
Additional task 27
# Напишіть програму, яка за числом n від 1 до 9 виводить на екран n
# пінгвінів. Зображення одного пінгвіна має розмір 5х9 символів.
# Вхідні дані:
# Вводиться натуральне число.
# Вихідні дані:
# Виводиться введена кількість пінгвінів у рядок.
# Примітка:
# Врахуйте, що виведення даних на екран робиться рядковим, а не попінгвінним.
#
# У деяких мовах програмування символ зворотного слеша “\” у текстових
# рядках має спеціальне значення. Щоб включити до текстового рядка
# такий символ, його потрібно повторити двічі. Наприклад, для виведення на екран
# одного такого символу можна використовувати такий код: print("\\").
#    _~_
#   (o o)
#  /  V  \
# /(  _  )\
#   ^^ ^^
#
# Приклад:
# Введить кількість пінгвінів: 3
'''

# pingv = {
#     1: '   _~_   ',
#     2: '  (o o)  ',
#     3: ' /  V  \\ ',
#     4: '/(  _  )\\',
#     5: '  ^^ ^^  '
#     }
#
# variable = int(input('Enter num 0-9: '))
# for v in pingv.values():
#     print()
#     for i in range(variable):
#         print(v, end=' ')