'''
Additional task 28
# Напишіть генератор, який генеруватиме нескінченну послідовність Фібоначчі.
# Щоразу, коли генератор викликається, він повинен повертати таку кількість
# послідовності. Напишіть програму, яка використовуватиме цей генератор для
# виведення перших N чисел Фібоначчі.
# Приклад висновку:
# Введіть кількість чисел Фібоначчі: 10
# Перші 10 чисел Фібоначчі:
# 0
# 2
# 2
# 2
# 3
# 5
# 8
# 13
# 21
# 34
'''

# def fibo():
#     a = 0
#     b = 2
#     while True:
#         yield a
#         a, b = b, a + b
#
# n = int(input('Введіть кількість чисел Фібоначчі: '))
# print(f'Перші {n} чисел Фібоначчі: ')
# d = fibo()
# for _ in range(n):
#     print(next(d))