'''
Additional task 3 Є кругла арена цирку, нам відомий її радіус, потрібно підібрати покриття
для цієї арени, щоб це зробити необхідно дізнатися про довжину і площу кола.
Напишіть програму, яка запитує у користувача радіус кола та виконує такі дії:
- обчислює довжину кола за формулою 2 * pi * r, де pi - математична константа
(приблизно дорівнює 3.14159), а r - радіус кола. Виводить результат.
- Обчислює площу кола за формулою pi * r^2, де pi - математична константа,
а r - радіус кола. Виводить результат.

Приклад:
Введіть радіус кола: 4.5

Довжина кола: 28.274333882308138
Площа кола: 63.61725123519331
'''

from math import pi

while True:
    try:
        r = float(input('Enter radius: '))
        break
    except ValueError:
        print('Ви ввели не число, спробуйте ще.')
square = pi * r ** 2
if square == 0:
    print(f'Площа кола = {int(square)}')
else:
    print(f'Площа кола = {square:.2f}')