'''
Additional task 31
# Напишіть програму, яка використовує рекурсію для обчислення суми цифр
# Числа. Створіть функцію sum_digits, яка приймає один аргумент – число,
# для якого потрібно обчислити суму цифр. Використовуйте умову виходу з
# рекурсії, коли число складається з однієї цифри. Виведіть результат на екран.
#
# Приклад:
# Введіть число: 12345
# Сума цифр числа 12345 дорівнює 15
'''

# def sum_digits(dig):
#
#     if dig <= 0:
#         return 0
#     return  dig % 10 + sum_digits(dig // 10)
#
# d = int(input('Enter digit: '))
# print(f'Sum digits {d} = {sum_digits(d)}')