'''
Additional task 9
# Напишіть програму, яка запитує у користувача число N і виводить
# перші N чисел Фібоначчі. Числа Фібоначчі - це послідовність чисел,
# де кожне наступне число є сумою двох попередніх чисел
# (починаючи з 0 та 1). Використовуйте цикл while для розв'язання задачі.
# Виведіть числа через кому за допомогою команди print.
#
# Приклад:
# Введіть число N: 7
# Перші 7 чисел Фібоначчі: 0, 1, 1, 2, 3, 5, 8
'''

fib = int(input("Enter number: "))
a = 0
b = 1
print(a, b, sep='\n')
while (fib - 2) > 0:
    s = a + b
    a = b
    b = s
    fib -= 1
    print(s)